document.getElementById('noButton2').addEventListener('click', function() {
    document.getElementById('response2').textContent = "Ну как хочешь";
    document.getElementById('response2').style.display = "block";
});

document.getElementById('yesButton2').addEventListener('click', function() {
    // Скрыть текст и показать кнопки годовщин
    document.getElementById('response2').style.display = "none";
    document.getElementById('anniversaryButtons').style.display = "block"; 
});

document.getElementById('anniversary1').addEventListener('click', function() {
    document.getElementById('response2').textContent = `
        Наша первая годовщина: вот мы с тобой уже как год вместе. Самый интересный год в моей жизни.
        Было много всего за это время, но самое важное, я обрёл тебя. Человек, который смог меня вытереть
        такое огромное количество времени. Это просто анриал, мало кто может со мной управиться.
        За время, когда появились не только поразнь ты и я, а именно мы, мы прошли через огромное количество этапов вместе.
        Радость, грусть, обуздание, подчинение, вредность, капризность, ревность, верность, копание в мозгах и перевоспитание.
        Самое интересное, что целый год пронёсся с тобой очень быстро. 31 536 000 секунд будто одним махом прошли сквозь меня,
        мою душу и сердце. Каждый день был наполнен любовью, нежностью, выёбистостью и я аж пропитался этим всем.
        Я стал по-другому воспринимать, любить, чувствовать тебя. Но ни на капельку эти чувства не затухали и не гасли.
        Это будто маленькая искорка, которая подожгла изнутри и заставила всего аж пылать.
        Знаешь, вот самое точное описание тебя: искорка. Вроде маленькая, миленькая, но сильная и могучая, никто не знает,
        какие последствия принесет, и вот принесла. Уже год как мы пара, мы стали сильнее, крепче, выносливее(чутка психически
        ебанулись из-за нехватки друг друга рядом, но думаю, мы это переживём, нам как никак ещё через всю жизнь пройти вместе),
        а ещё стали любить и ценить друг друга сильнее.
        Всё же это особая дата для нас двоих и хотелось бы быть вместе, но не судьба пока. Но и мы не отчаиваемся, столько
        таких дат впереди.
        Не хочу говорить наперёд, но знаю точно, это не последняя дата, у нас миллионы таких будет. Ты моё вечное солнце.
        То солнце на небе погаснет, а моя любовь к тебе никогда.
        Так что от всей души, с нашим праздничком 💗💗🥳
    `;
    document.getElementById('response2').style.display = "block";
});

document.getElementById('anniversary2').addEventListener('click', function() {
    document.getElementById('response2').textContent = `
        Вот и подошли наших 2 года вместе. О боже, целых два. Два поистине огромных года, которые длятся одновременно
        вечность и мгновение. Будем честны, за это время произошло столько всего, что даже сложно описать.
        Были и моменты, когда сердце вылетало из груди, были и когда от смеха живот болел, были и такие, что глаза на мокром
        месте стояли. Но если этот список продолжать, то буду писать, пока не поседею. Так что вот, я не буду описывать всё,
        как в прошлые разы. В этот раз я хочу подытожить, наши совместные года, сколько мы пережили и сколько нам ещё предстоит.
        Я никогда не встречал таких людей, чтобы ну втюрился как малолетка по уши и не отпускает, а тут вот тебе раз,
        фартонуло и речь идёт о тебе🫶.
        Когда-то давно два человечка встретили друг друга среди миллиардов людей, и вот уже взрослые(не самостоятельные),
        зрелые(балованные), умные(ленивые) и реально любящие амёбы встретились ахпха💗. Этот день реально особенный, ведь
        он только для нас, это наша дата и наш день, который запланирован и забронирован на каждый год, несмотря ни на что.
        Так что в этот день хочу сказать, что какая бы пиздень не творилась, я буду рядом, как бы тяжело не было, я буду рядом
        и даже как бы ты не хохотала, я тоже буду рядом, ведь ты для меня очень важна и ты столько всего приносишь в мою жизнь,
        что просто ёбнуться можно. Тот человек, который показал, что такое открыть душу, изменить себя и любить выебываться ахпха.
        Тот человечек, который сам открылся, показал душу, хоть было и страшно. Так что хочу сказать, что я тебя безумнейше
        люблю, ценю, дорожу и отдам за тебя всё, что у меня есть. Спасибо тебе за эти прекрасные 2 года вместе, эти 2 года,
        которые мы иногда бывали рядом физически, но всегда были рядом душами и морально.
    `;
    document.getElementById('response2').style.display = "block";
});

document.getElementById('anniversary3').addEventListener('click', function() {
    document.getElementById('response2').textContent = `
        Ты уж и сама почитаешь недавнюю переписку)
    `;
    document.getElementById('response2').style.display = "block";
});
